<script>
import { useStore } from 'vuex'
import { ref } from 'vue'
import Bcrumb from '@/components/Bcrumb.vue'

export default {
    components: { Bcrumb },
    setup() {
        // Определяем наше хранилище
        const store = useStore()

        const list = [
            {
                name: 'Как определить свой размер',
                desc: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
            {
                name: 'Как скачать выкройку',
                desc: 'Выкройка плаща. Плащ свободного объема, немного расклешенного силуэта, длиной ниже линии колен, без подкладки. Перед с центральной бортовой застежкой на кнопки или пришивные пуговицы и обметанные петли. На детали передней части накладной карман. Спинка со средним швом и расположенным в области талии хлястиком, который немного собирает объем спинки.',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
            {
                name: 'Как купить и посмотреть мастер-классы',
                desc: 'Для плечевых изделий (платье, блуза, пальто) основной выбор размера производится по измерению обхвата груди. Например, у вас обхват груди равен 84 см. Делим 84 см пополам и получаем типовой размер: 42.',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
            {
                name: 'Как скачать выкройку',
                desc: 'Выкройка плаща. Плащ свободного объема, немного расклешенного силуэта, длиной ниже линии колен, без подкладки. Перед с центральной бортовой застежкой на кнопки или пришивные пуговицы и обметанные петли. На детали передней части накладной карман. Спинка со средним швом и расположенным в области талии хлястиком, который немного собирает объем спинки.',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
            {
                name: 'Как купить и посмотреть мастер-классы',
                desc: 'Для плечевых изделий (платье, блуза, пальто) основной выбор размера производится по измерению обхвата груди. Например, у вас обхват груди равен 84 см. Делим 84 см пополам и получаем типовой размер: 42.',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
            {
                name: 'Как скачать выкройку',
                desc: 'Выкройка плаща. Плащ свободного объема, немного расклешенного силуэта, длиной ниже линии колен, без подкладки. Перед с центральной бортовой застежкой на кнопки или пришивные пуговицы и обметанные петли. На детали передней части накладной карман. Спинка со средним швом и расположенным в области талии хлястиком, который немного собирает объем спинки.',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
            {
                name: 'Как купить и посмотреть мастер-классы',
                desc: 'Для плечевых изделий (платье, блуза, пальто) основной выбор размера производится по измерению обхвата груди. Например, у вас обхват груди равен 84 см. Делим 84 см пополам и получаем типовой размер: 42.',
                answer: 'Определение размера и печать осуществляется в соответствии с инструкциями Grasser. Также вы можете спокойно задавать нам все вопросы по пошиву, мы всегда будем отвечать так же внимательно, как обычно! Приятного вам пошива и прекрасного результата!',
            },
        ]

        const index = ref(1)

        const show = (i) => {
            index.value = i
        }
        return { list, index, show }
    },
}
</script>

<template>
    <Bcrumb :array="['home']" />

    <h1>
        Часто задаваемые <br />
        вопросы
    </h1>

    <section>
        <article>
            <ul>
                <li v-for="(item, i) in list" :key="i" :class="{ active: index === i }">
                    <span v-on:click="show(i)">{{ item.name }}</span>
                    <p v-show="index === i">{{ item.desc }}</p>
                    <p v-show="index === i">
                        <i>{{ item.answer }}</i>
                    </p>
                </li>
            </ul>
        </article>
    </section>
</template>

<style lang="scss" scoped>
h1 {
    margin: auto auto var(--scheme-gap);
    max-width: var(--scheme-width);
    padding: 0 var(--scheme-gap);
}

section {
    margin: auto;
    max-width: var(--scheme-width);
    padding: var(--scheme-gap);

    article {
        ul {
            margin: var(--scheme-gap) 0;

            li {
                border-bottom: 1px solid var(--scheme-v6);
                display: grid;
                margin: 0 0 20px;

                span {
                    cursor: pointer;
                    font-size: var(--scheme-font-32);
                    grid-row: 1;
                    padding: 20px 20px 20px 0;
                }

                &::after {
                    background-color: var(--scheme-v5);
                    border-radius: 10px;
                    color: var(--scheme-v3);
                    content: '\e007';
                    font-family: 'fadi';
                    font-size: 20px;
                    grid-row: 1;
                    margin: auto 0 auto auto;
                    padding: 0px 6px;
                    transform: rotate(270deg);
                }

                &.active {
                    &::after {
                        content: none;
                    }
                }
            }
        }
    }
}

// базовый breakpoint 1152px
@media all and (max-width: 72em) {
}
</style>
