<script setup>
// Check out https://vuejs.org/api/sfc-script-setup.html#script-setup
// UI
import Backward from '@/components/ui/Backward.vue'
import Size from '@/components/ui/Size.vue'
import Included from '@/components/ui/Included.vue'
import NamedButton from '@/components/ui/NamedButton.vue'
// Список популярных товаров
import PopularPatterns from '@/components/PopularPatterns.vue'
import Swiper from '@/components/Swiper.vue'
</script>

<template>
    <section>
        <Backward :crumbs="['выкройки', 'для женщин', 'свитер']" />

        <Swiper />

        <article>
            <h1>Свитер, выкройка Fadi №1</h1>

            <Included :array="['Средняя сложность', 'Подробная инструкция', 'Плоттер 600']" />

            <Size :array="[38, 40, 42, 44, 46, 48]" />

            <h4>150 р</h4>

            <NamedButton icon="icon-arrow-top-right" text="Добавить в корзину" />

            <p>
                <small>Ссылки на скачивание купленной выкройки будут отправлены на ваш электронный адрес, а также скачать выкройки можно в личном кабинете</small>
            </p>

            <h5>Как скачать</h5>

            <ol>
                <li>Выберите понравившуюся модель, размер и рост.</li>
                <li>Добавьте выкройку в корзину.</li>
                <li>В разделе «Корзина» вы увидите все свои товары, и можете скорректировать заказ.</li>
                <li>Далее нажмите кнопку «К оформлению заказа». Авторизуйтесь или зарегистрируйтесь, если вы не сделали этого ранее.</li>
                <li>Выберите вид оплаты: Робокасса, ЮКасса или PayPal. И перейдите к оплате.</li>
            </ol>

            <p>Сразу после оплаты файлы выкроек станут доступны для скачивания в вашем личном кабинете. А также ссылки для скачивания придут в письме на электронную почту.</p>
            <p>
                Обратите внимание! Для скачивания купленной выкройки, как в личном кабинете так и из письма-уведомления, нужно быть авторизованным на сайте с тем логином и паролем
                с которым вы совершали покупку.
            </p>

            <h5>Как купить из другой страны</h5>
            <p>
                Оплата из Казахстана, Украины, Белоруссии, Крыма доступна с помощью платежных сервисов Робокасса и Юкасса! Ничего устанавливать не нужно, нужно просто нажать кнопку
                "оплатить заказ", и перейти в сервис для выбора платежа.
            </p>

            <p>
                Заказ из другой страны в платежных сервисах можно оплатить банковской картой Visa, MasterCard. Ваш банк сам сделает процедуру конвертации валюты в процессе оплаты.
                Комиссию за конвертацию устанавливает банк клиента, вам нужно уточнять размер комиссии в своем банке.
            </p>
            <p>Также оплатить не из России можно с помощью кошелька PayPal.</p>

            <h5>Описание</h5>

            <p>
                Выкройка воротника. Аксессуар съемный – воротник меховой, на подкладке, с застежкой на пату на петли и пуговицы. На фото представлен воротник, сшитый в бюро FADI по
                выкройке №1
            </p>

            <p>
                В образе на фото также представлены: пальто по выкройке №1, водолазка по выкройке №1, брюки по выкройке №1, юбка по бесплатной выкройке №1 Выкройка в вашем заказе
                будет в двух вариантах печати:
            </p>

            <ol>
                <li>Для печати на А4/Letter. Нужно распечатать выкройку на принтере на листах формата А4/Letter, склеить листы и вырезать выкройку.</li>
                <li>Для печати на широкоформатном плоттере.</li>
            </ol>

            <p>Для проверки масштаба печати на А4/Letter используйте Тестовый квадрат, расположенный на первом листе в файле А4/Letter.</p>

            <p>Высота воротника - 21,8 см, ширина воротника - 66,4 см.</p>

            <h5>Рекомендуемый материал для пошива</h5>

            <p><b>Основной материал.</b> Мы рекомендуем использовать для данной модели искусственный или натуральный мех со средней длиной ворса или длинным ворсом.</p>
            <p>
                <b>Подкладочный материал.</b> В качестве подкладки рекомендуем использовать плотные, средней толщины материалы, подходящие по пластичным свойствам и плотности к
                материалу верха из натуральных, синтетических или смесовых волокон. В качестве подкладки могут быть использованы подкладочные, костюмные, пальтовые и другие
                материалы.
            </p>
            <p>
                <b>Дублирующие материалы.</b> Для более качественного пошива мы рекомендуем использовать клеевые дублерины. Для дублирования деталей необходимы клеевые дублерины
                плотностью 55 г/м2 шириной 150 см. Плотность дублерина подбирайте в зависимости от плотности основной ткани.
            </p>

            <h5>Расход основного материала</h5>

            <ol>
                <li>Основной материал при ширине 140 см: 0,25.</li>

                <li>Подкладочный материал при ширине 140 см: 0,25.</li>

                <li>Дублерин плотностью 55 гр/м2 при ширине 150 см: 0,25.</li>

                <li>Долевая клеевая кромка: 1,55.</li>
            </ol>

            <p>
                ВАЖНО! Мы даем точный расход, на плотную раскладку деталей. Материал может дать усадку, поэтому рекомендуем провести тест, рассчитать процент усадки, и полученный
                результат прибавить к расходу.
            </p>

            <p>Фурнитура: Пуговица диаметром 20 - 22 мм – 2 шт.</p>

            <h5>Что понадобится</h5>

            <ol>
                <li>Универсальная швейная машина;</li>
                <li>Утюг с паром или без;</li>
                <li>Стандартная (двухрожковая) лапка;</li>
                <li>Утюжильный стол или консоль;</li>
                <li>Лаваш для вто или деревянный утюжок;</li>
                <li>Ручная игла для сметочных работ;</li>
                <li>Машинные иглы № 80-90;</li>
                <li>Ножницы для бумаги;</li>
                <li>Ножницы для раскроя материалов.</li>
            </ol>
        </article>

        <PopularPatterns />
    </section>
</template>

<style lang="scss" scoped>
section {
    display: grid;
    gap: var(--scheme-gap);

    h1 {
        font: 400 var(--scheme-xm) / 1.42 var(--scheme-font);
    }

    section {
        border-top: 1px solid var(--scheme-v3);
        grid-column: 1 / 3;
        padding: var(--scheme-gap) 0;
    }

    picture {
        grid-column: 1 / 2;
    }

    article {
        p {
            small {
                display: block;
                margin: 20px 0;
                opacity: 0.6;
            }
        }

        h5 {
            margin: 40px 0;
        }

        ol {
            font-size: 24px;
            padding: 0;
            margin: 40px 0;

            li {
                font-size: var(--scheme-s);
                margin: 8px 0 8px 20px;
            }

            h5 {
                color: var(--scheme-v2);
                margin: 40px 0 0;
            }

            p {
                font-size: var(--scheme-s);
                margin: 20px 0;

                b {
                    color: var(--scheme-v2);
                }
            }
        }
    }

    button {
        background-color: var(--scheme-v2);
        color: var(--scheme-v4);
        margin: var(--scheme-gap) auto auto 0;
    }

    @media all and (max-width: 60em) {
        article,
        picture {
            grid-column: 1 / 3;
        }
    }
}
</style>
